#+TITLE: EMACS Configuration
#+AUTHOR: Amogh Jalihal

* Where to look for packages
[2019-01-31 Thu]
#+begin_src emacs-lisp
  (add-to-list 'load-path
               "~/.emacs.d/elpa/helm") ; facultative when installed with make install

  (add-to-list 'load-path
               "~/.emacs.d/elpa/helm-bibtex")

  (add-to-list 'load-path
               "~/.emacs.d/plugins/yasnippet")

  (add-to-list 'load-path
               "~/.emacs.d/lisp/")

   (add-to-list 'load-path
                "~/.emacs.d/elpa/ob-ipython/")

   (add-to-list 'load-path
                "~/.emacs.d/elpa/ox-ipynb/")

  (add-to-list 'load-path
               "~/projects/tidal")

  (add-to-list 'load-path "/usr/share/org-mode/lisp")

  (add-to-list 'load-path
               "~/.emacs.d/plugins/org-alert")


#+end_src

#+RESULTS:
| ~/.emacs.d/plugins/org-alert | /home/jalihal/.emacs.d/elpa/org-plus-contrib-20190204 | /home/jalihal/.emacs.d/elpa/ace-link-20190127.1654 | /home/jalihal/.emacs.d/elpa/avy-20190204.1201 | /home/jalihal/.emacs.d/elpa/cdlatex-20190130.1419 | /home/jalihal/.emacs.d/elpa/company-20190205.1900 | /home/jalihal/.emacs.d/elpa/dash-20190128.1920 | /home/jalihal/.emacs.d/elpa/docker-20190104.1004 | /home/jalihal/.emacs.d/elpa/elpy-20190130.2109 | /home/jalihal/.emacs.d/elpa/emms-20190206.1537 | /home/jalihal/.emacs.d/elpa/evil-20190104.1026 | /home/jalihal/.emacs.d/elpa/f-20190109.906 | /home/jalihal/.emacs.d/elpa/ghub-20190127.2354 | /home/jalihal/.emacs.d/elpa/google-translate-20190206.1229 | /home/jalihal/.emacs.d/elpa/goto-chg-20190110.2114 | /home/jalihal/.emacs.d/elpa/gruvbox-theme-20190128.838 | /home/jalihal/.emacs.d/elpa/helm-20190206.659 | /home/jalihal/.emacs.d/elpa/helm-bibtex-20190113.1845 | /home/jalihal/.emacs.d/elpa/helm-core-20190205.1337 | /home/jalihal/.emacs.d/elpa/hydra-20190206.1051 | /home/jalihal/.emacs.d/elpa/ivy-20190207.1146 | /home/jalihal/.emacs.d/elpa/json-mode-20190123.422 | /home/jalihal/.emacs.d/elpa/julia-mode-20190111.2044 | /home/jalihal/.emacs.d/elpa/magit-20190202.1535 | /home/jalihal/.emacs.d/elpa/math-symbol-lists-20190102.1831 | /home/jalihal/.emacs.d/elpa/org-20190204 | /home/jalihal/.emacs.d/elpa/org-brain-20190111.1227 | /home/jalihal/.emacs.d/elpa/org-download-20190114.1600 | /home/jalihal/.emacs.d/elpa/org-edna-1.0.2 | /home/jalihal/.emacs.d/elpa/org-noter-20190121.2140 | /home/jalihal/.emacs.d/elpa/org-ref-20190118.1502/citeproc/csl | /home/jalihal/.emacs.d/elpa/org-ref-20190118.1502/citeproc | /home/jalihal/.emacs.d/elpa/org-ref-20190118.1502 | /home/jalihal/.emacs.d/elpa/org-variable-pitch-20190128.2051 | /home/jalihal/.emacs.d/elpa/pdf-tools-20190129.1822 | /home/jalihal/.emacs.d/elpa/php-mode-20190109.1320 | /home/jalihal/.emacs.d/elpa/poet-theme-20190127.2220 | /home/jalihal/.emacs.d/elpa/smartparens-20190128.1747 | /home/jalihal/.emacs.d/elpa/spacemacs-theme-20190116.2107 | /home/jalihal/.emacs.d/elpa/tablist-20190129.1813 | /home/jalihal/.emacs.d/elpa/tidal-20190108.1748 | /home/jalihal/.emacs.d/elpa/org-ref-20181221.1716/citeproc/csl | /home/jalihal/.emacs.d/elpa/org-ref-20181221.1716/citeproc | /usr/share/org-mode/lisp | ~/projects/tidal | ~/.emacs.d/elpa/ox-ipynb/ | ~/.emacs.d/elpa/ob-ipython/ | ~/.emacs.d/lisp/ | ~/.emacs.d/plugins/yasnippet | ~/.emacs.d/elpa/helm-bibtex | ~/.emacs.d/elpa/helm | /home/jalihal/.emacs.d/elpa/ac-math-20141116.2127 | /home/jalihal/.emacs.d/elpa/ace-link-20181210.1454 | /home/jalihal/.emacs.d/elpa/auctex-12.1.1/ | /home/jalihal/.emacs.d/elpa/auctex-12.1.1 | /home/jalihal/.emacs.d/elpa/avy-20181126.1705 | /home/jalihal/.emacs.d/elpa/calfw-20180118.45 | /home/jalihal/.emacs.d/elpa/calfw-org-20160303.258 | /home/jalihal/.emacs.d/elpa/captain-1.0.3 | /home/jalihal/.emacs.d/elpa/cdlatex-20140707.1126 | /home/jalihal/.emacs.d/elpa/chronos-20150602.1529 | /home/jalihal/.emacs.d/elpa/column-enforce-mode-20171030.1900 | /home/jalihal/.emacs.d/elpa/dash-functional-20180107.1618 | /home/jalihal/.emacs.d/elpa/diminish-20170419.1736 | /home/jalihal/.emacs.d/elpa/docker-20181215.1826 | /home/jalihal/.emacs.d/elpa/docker-tramp-20170207.325 | /home/jalihal/.emacs.d/elpa/elfeed-org-20181015.1100 | /home/jalihal/.emacs.d/elpa/elfeed-20181127.1943 | /home/jalihal/.emacs.d/elpa/elpy-20181228.1721 | /home/jalihal/.emacs.d/elpa/company-20181221.1538 | /home/jalihal/.emacs.d/elpa/emms-20181122.1932 | /home/jalihal/.emacs.d/elpa/esup-20180727.342 | /home/jalihal/.emacs.d/elpa/evil-20181206.1209 | /home/jalihal/.emacs.d/elpa/find-file-in-project-20181217.246 | /home/jalihal/.emacs.d/elpa/ghub-20190102.109 | /home/jalihal/.emacs.d/elpa/git-gutter-20161105.1356 | /home/jalihal/.emacs.d/elpa/git-timemachine-20181204.1546 | /home/jalihal/.emacs.d/elpa/goto-chg-20181228.1303 | /home/jalihal/.emacs.d/elpa/graphql-20180912.31 | /home/jalihal/.emacs.d/elpa/gruvbox-theme-20181013.1144 | /home/jalihal/.emacs.d/elpa/autothemer-20180920.923 | /home/jalihal/.emacs.d/elpa/helm-cmd-t-20170125.1459 | /home/jalihal/.emacs.d/elpa/helm-swoop-20180215.1154 | /home/jalihal/.emacs.d/elpa/highlight-indentation-20181204.839 | /home/jalihal/.emacs.d/elpa/json-mode-20180718.809 | /home/jalihal/.emacs.d/elpa/json-reformat-20160212.853 | /home/jalihal/.emacs.d/elpa/json-snatcher-20150512.347 | /home/jalihal/.emacs.d/elpa/julia-mode-20180816.2117 | /home/jalihal/.emacs.d/elpa/kanban-20170418.810 | /home/jalihal/.emacs.d/elpa/magit-20190102.107 | /home/jalihal/.emacs.d/elpa/git-commit-20190102.107 | /home/jalihal/.emacs.d/elpa/magit-popup-20181204.2031 | /home/jalihal/.emacs.d/elpa/math-symbol-lists-20170221.1353 | /home/jalihal/.emacs.d/elpa/matlab-mode-20180928.1526 | /home/jalihal/.emacs.d/elpa/md4rd-20181209.512 | /home/jalihal/.emacs.d/elpa/hierarchy-20171221.1151 | /home/jalihal/.emacs.d/elpa/minimap-1.2 | /home/jalihal/.emacs.d/elpa/notify-2010.8.20 | /home/jalihal/.emacs.d/elpa/notmuch-20181208.1245 | /home/jalihal/.emacs.d/elpa/ob-translate-20170720.1919 | /home/jalihal/.emacs.d/elpa/google-translate-20181202.56 | /home/jalihal/.emacs.d/elpa/olivetti-20180531.737 | /home/jalihal/.emacs.d/elpa/openwith-20120531.2136 | /home/jalihal/.emacs.d/elpa/org-alert-20180524.133 | /home/jalihal/.emacs.d/elpa/org-brain-20181228.4 | /home/jalihal/.emacs.d/elpa/org-bullets-20180208.2343 | /home/jalihal/.emacs.d/elpa/org-dashboard-20171223.1924 | /home/jalihal/.emacs.d/elpa/org-download-20180925.1528 | /home/jalihal/.emacs.d/elpa/org-drill-table-20180115.1009 | /home/jalihal/.emacs.d/elpa/org-edna-1.0.1 | /home/jalihal/.emacs.d/elpa/org-gnome-20150614.1457 | /home/jalihal/.emacs.d/elpa/gnome-calendar-20161110.1256 | /home/jalihal/.emacs.d/elpa/alert-20181022.1742 | /home/jalihal/.emacs.d/elpa/log4e-20170401.1304 | /home/jalihal/.emacs.d/elpa/gntp-20141025.250 | /home/jalihal/.emacs.d/elpa/org-noter-20181106.2341 | /home/jalihal/.emacs.d/elpa/org-plus-contrib-20181230 | /home/jalihal/.emacs.d/elpa/org-present-20180303.2330 | /home/jalihal/.emacs.d/elpa/org-ref-20181221.1716 | /home/jalihal/.emacs.d/elpa/key-chord-20160227.1238 | /home/jalihal/.emacs.d/elpa/hydra-20181128.1716 | /home/jalihal/.emacs.d/elpa/ivy-20181223.2002 | /home/jalihal/.emacs.d/elpa/helm-bibtex-20181030.2142 | /home/jalihal/.emacs.d/elpa/biblio-20161014.2304 | /home/jalihal/.emacs.d/elpa/biblio-core-20160901.1815 | /home/jalihal/.emacs.d/elpa/f-20180106.922 | /home/jalihal/.emacs.d/elpa/helm-20181222.848 | /home/jalihal/.emacs.d/elpa/helm-core-20181225.639 | /home/jalihal/.emacs.d/elpa/htmlize-20180923.1829 | /home/jalihal/.emacs.d/elpa/org-variable-pitch-20181206.1451 | /home/jalihal/.emacs.d/elpa/ox-rst-20180315.13 | /home/jalihal/.emacs.d/elpa/org-20181230 | /home/jalihal/.emacs.d/elpa/parsebib-20181219.928 | /home/jalihal/.emacs.d/elpa/pdf-tools-20181221.1913 | /home/jalihal/.emacs.d/elpa/php-mode-20181228.207 | /home/jalihal/.emacs.d/elpa/poet-theme-20190101.2245 | /home/jalihal/.emacs.d/elpa/popwin-20150315.1300 | /home/jalihal/.emacs.d/elpa/pretty-mode-20160614.1846 | /home/jalihal/.emacs.d/elpa/pyvenv-20181228.1722 | /home/jalihal/.emacs.d/elpa/request-20181129.1138 | /home/jalihal/.emacs.d/elpa/sclang-extensions-20160509.338 | /home/jalihal/.emacs.d/elpa/s-20180406.808 | /home/jalihal/.emacs.d/elpa/auto-complete-20170125.245 | /home/jalihal/.emacs.d/elpa/popup-20160709.1429 | /home/jalihal/.emacs.d/elpa/sexy-monochrome-theme-20180526.808 | /home/jalihal/.emacs.d/elpa/smart-mode-line-20180926.1036 | /home/jalihal/.emacs.d/elpa/rich-minority-20170813.1322 | /home/jalihal/.emacs.d/elpa/smartparens-20190112.1318 | /home/jalihal/.emacs.d/elpa/dash-20180910.1856 | /home/jalihal/.emacs.d/elpa/spacemacs-theme-20181107.1725 | /home/jalihal/.emacs.d/elpa/ssh-20120904.2042 | /home/jalihal/.emacs.d/elpa/tablist-20170220.335 | /home/jalihal/.emacs.d/elpa/telepathy-20131209.1258 | /home/jalihal/.emacs.d/elpa/tidal-20181219.900 | /home/jalihal/.emacs.d/elpa/haskell-mode-20181122.823 | /home/jalihal/.emacs.d/elpa/tree-mode-20151104.1331 | /home/jalihal/.emacs.d/elpa/treepy-20180724.656 | /home/jalihal/.emacs.d/elpa/twittering-mode-20181121.1402 | /home/jalihal/.emacs.d/elpa/typo-20171209.1023 | /home/jalihal/.emacs.d/elpa/undo-tree-20170706.246 | /home/jalihal/.emacs.d/elpa/use-package-20181119.2350 | /home/jalihal/.emacs.d/elpa/bind-key-20180513.430 | /home/jalihal/.emacs.d/elpa/visual-regexp-20170301.116 | /home/jalihal/.emacs.d/elpa/which-key-20181114.1432 | /home/jalihal/.emacs.d/elpa/with-editor-20181113.1845 | /home/jalihal/.emacs.d/elpa/async-20181224.454 | /home/jalihal/.emacs.d/elpa/yasnippet-20181015.1212 | /usr/local/share/emacs/26.1/site-lisp | /usr/local/share/emacs/site-lisp | /usr/local/share/emacs/site-lisp/helm | /usr/local/share/emacs/26.1/lisp | /usr/local/share/emacs/26.1/lisp/vc | /usr/local/share/emacs/26.1/lisp/url | /usr/local/share/emacs/26.1/lisp/textmodes | /usr/local/share/emacs/26.1/lisp/progmodes | /usr/local/share/emacs/26.1/lisp/play | /usr/local/share/emacs/26.1/lisp/org | /usr/local/share/emacs/26.1/lisp/nxml | /usr/local/share/emacs/26.1/lisp/net | /usr/local/share/emacs/26.1/lisp/mh-e | /usr/local/share/emacs/26.1/lisp/mail | /usr/local/share/emacs/26.1/lisp/leim | /usr/local/share/emacs/26.1/lisp/language | /usr/local/share/emacs/26.1/lisp/international | /usr/local/share/emacs/26.1/lisp/image | /usr/local/share/emacs/26.1/lisp/gnus | /usr/local/share/emacs/26.1/lisp/eshell | /usr/local/share/emacs/26.1/lisp/erc | /usr/local/share/emacs/26.1/lisp/emulation | /usr/local/share/emacs/26.1/lisp/emacs-lisp | /usr/local/share/emacs/26.1/lisp/cedet | /usr/local/share/emacs/26.1/lisp/calendar | /usr/local/share/emacs/26.1/lisp/calc | /usr/local/share/emacs/26.1/lisp/obsolete |

** Theme
+As of <2018-01-07 Sun>, I am using theme-changer.el to use a light theme during the day and dark theme at night.+
+Disable theme changer by commenting out lines in the [[*Theme Changer][Theme Changer]] entry.+
Reverted
#+BEGIN_SRC emacs-lisp
  ;;(load-theme 'gruvbox t) 
  ;;(load-theme 'sexy-monochrome t)
  ;; Modified on 2018-02-14
  ;; (load-theme 'spacemacs-dark t)
#+END_SRC
<2018-06-20 Wed>
From https://emacs.stackexchange.com/questions/3112/how-to-reset-color-theme
#+BEGIN_SRC emacs-lisp
  ;; (defadvice load-theme (before theme-dont-propagate activate)
  ;; (mapcar #'disable-theme custom-enabled-themes))

#+END_SRC

#+RESULTS:
: load-theme

[2019-02-21 Thu 20:42]
Cyberpunk theme!
#+begin_src emacs-lisp
  (add-to-list 'custom-theme-load-path "~/.emacs.d/lisp/")
  (load-theme 'cyberpunk-2019 t)

  (require 'powerline)
  (powerline-default-theme)
#+end_src

#+RESULTS:
| %e | (:eval (let* ((active (powerline-selected-window-active)) (mode-line-buffer-id (if active (quote mode-line-buffer-id) (quote mode-line-buffer-id-inactive))) (mode-line (if active (quote mode-line) (quote mode-line-inactive))) (face0 (if active (quote powerline-active0) (quote powerline-inactive0))) (face1 (if active (quote powerline-active1) (quote powerline-inactive1))) (face2 (if active (quote powerline-active2) (quote powerline-inactive2))) (separator-left (intern (format powerline-%s-%s (powerline-current-separator) (car powerline-default-separator-dir)))) (separator-right (intern (format powerline-%s-%s (powerline-current-separator) (cdr powerline-default-separator-dir)))) (lhs (list (powerline-raw %* face0 (quote l)) (when powerline-display-buffer-size (powerline-buffer-size face0 (quote l))) (when powerline-display-mule-info (powerline-raw mode-line-mule-info face0 (quote l))) (powerline-buffer-id (` (mode-line-buffer-id (, face0))) (quote l)) (when (and (boundp (quote which-func-mode)) which-func-mode) (powerline-raw which-func-format face0 (quote l))) (powerline-raw   face0) (funcall separator-left face0 face1) (when (and (boundp (quote erc-track-minor-mode)) erc-track-minor-mode) (powerline-raw erc-modified-channels-object face1 (quote l))) (powerline-major-mode face1 (quote l)) (powerline-process face1) (powerline-minor-modes face1 (quote l)) (powerline-narrow face1 (quote l)) (powerline-raw   face1) (funcall separator-left face1 face2) (powerline-vc face2 (quote r)) (when (bound-and-true-p nyan-mode) (powerline-raw (list (nyan-create)) face2 (quote l))))) (rhs (list (powerline-raw global-mode-string face2 (quote r)) (funcall separator-right face2 face1) (unless window-system (powerline-raw (char-to-string 57505) face1 (quote l))) (powerline-raw %4l face1 (quote l)) (powerline-raw : face1 (quote l)) (powerline-raw %3c face1 (quote r)) (funcall separator-right face1 face0) (powerline-raw   face0) (powerline-raw %6p face0 (quote r)) (when powerline-display-hud (powerline-hud face0 face2)) (powerline-fill face0 0)))) (concat (powerline-render lhs) (powerline-fill face2 (powerline-width rhs)) (powerline-render rhs)))) |

** Poet Theme customizations
[2019-01-02 Wed]
#+begin_src emacs-lisp
  ;;   (let* ((variable-tuple
  ;;           (cond ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
  ;;                 ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
  ;;                 ((x-list-fonts "Verdana")         '(:font "Verdana"))
  ;;                 ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
  ;;                 (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
  ;;          (base-font-color     (face-foreground 'default nil 'default))
  ;;          (headline           `(:inherit default :weight bold )))

  ;;     (custom-theme-set-faces
  ;;      'user
  ;;      `(org-level-8 ((t (,@headline ,@variable-tuple))))
  ;;      `(org-level-7 ((t (,@headline ,@variable-tuple))))
  ;;      `(org-level-6 ((t (,@headline ,@variable-tuple))))
  ;;      `(org-level-5 ((t (,@headline ,@variable-tuple))))
  ;;      `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
  ;;      `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.25))))
  ;;      `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.5))))
  ;;      `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.75))))
  ;;      `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil))))))
  ;; (custom-theme-set-faces
  ;;  'user
  ;;  '(variable-pitch ((t (:family "Segoe UI Semibold-9" :height 180 :weight light))))
  ;;  '(fixed-pitch ((t ( :family "Inconsolata" :slant normal :weight normal :height 1.0 :width normal)))))
  ;;     ;; (add-hook 'org-mode-hook
  ;;     ;;             '(lambda ()
  ;;     ;;                (variable-pitch-mode 1)
  ;;     ;;                (mapc
  ;;     ;;                 (lambda (face)
  ;;     ;;                   (set-face-attribute face nil :inherit 'fixed-pitch))
  ;;     ;;                 (list 'org-code
  ;;     ;;                       'org-link 
  ;;     ;;                       'org-block
  ;;     ;;                       'org-table
  ;;     ;;                       'org-block-begin-line
  ;;     ;;                       'org-block-end-line
  ;;     ;;                       'org-meta-line
  ;;     ;;                       'org-document-info-keyword))))
  ;;       ;; (add-hook 'text-mode-hook
  ;;       ;;             (lambda ()
  ;;       ;;               (variable-pitch-mode 1)))
  ;; (add-hook 'org-mode-hook 'variable-pitch-mode)
          ;;(set-face-attribute 'variable-pitch nil :family "Baskerville")
        ;; (set-face-attribute 'default nil :family "Iosevka" :height 130)
        ;; (set-face-attribute 'fixed-pitch nil :family "Iosevka")
        ;; (set-face-attribute 'variable-pitch nil :family "Baskerville")
        ;; ;; (olivetti-mode 1)        ;; Centers text in the buffer
        ;; (flyspell-mode 1)        ;; Catch Spelling mistakes
        ;; (typo-mode 1)            ;; Good for symbols like em-dash

        ;; (blink-cursor-mode 0)    ;; Reduce visual noise
        ;; (linum-mode 0)           ;; No line numbers for pros

        ;; (require 'org-bullets)
        ;; (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

        ;;   (setq org-bullets-bullet-list
        ;;       '("◉" "○"))
        ;;   (org-bullets 1)
#+end_src

#+RESULTS:
| variable-pitch-mode | (lambda nil (variable-pitch-mode 1) (mapc (lambda (face) (set-face-attribute face nil :inherit (quote fixed-pitch))) (list (quote org-code) (quote org-link) (quote org-block) (quote org-table) (quote org-block-begin-line) (quote org-block-end-line) (quote org-meta-line) (quote org-document-info-keyword)))) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-ref-org-menu | ob-ipython-auto-configure-kernels | (lambda nil (progn (parenthesis-register-keys [($~ org-mode-map))) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

** Clean up modeline
<2018-11-21 Wed>
#+BEGIN_SRC emacs-lisp
(diminish 'company-mode)
(diminish 'yas-minor-mode)
(diminish 'eldoc-mode)
(diminish 'helm-mode)
(diminish 'org-mode)
(diminish 'org-agenda-mode)
(diminish 'projectile-mode)
#+END_SRC

#+RESULTS:
|   |
** Open with external programs
[2019-01-14 Mon]
#+begin_src emacs-lisp
  ;; (require 'openwith)
  ;; (openwith-mode t)
  ;; (setq openwith-associations '(("\\.pdf\\'" "evince" (file))))
#+end_src

#+RESULTS:
| \.pdf\' | evince | (file) |

** Customizing modeline
#+begin_src emacs-lisp
  ;; (setq aj-sec (with-temp-buffer
  ;;              (insert-file-contents "~/orgs/secrets")
  ;;              ;;(buffer-string))
  ;;             (replace-regexp-in-string "[ \t \n]*" "" (buffer-string))))

  ;; (setq mode-line-format
  ;;       (append
  ;;        mode-line-format
  ;;        '(" <<" 'aj-sec ">> " )))

#+end_src

#+RESULTS:
| %e | mode-line-front-space | mode-line-mule-info | mode-line-client | mode-line-modified | mode-line-remote | mode-line-frame-identification | mode-line-buffer-identification |   | mode-line-position | (vc-mode vc-mode) |   | mode-line-modes | mode-line-misc-info | mode-line-end-spaces | << | (quote aj-sec) | >> | << | (quote aj-sec) | >> |

* Company
#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'global-company-mode)

  (with-eval-after-load 'company 
    (add-to-list 'company-backends 'company-jedi 'company-math-symbols-latex))
  ;; (add-to-list 'company-backends 'company-ob-ipython) ;

#+END_SRC

#+RESULTS:
| company-bbdb | company-eclim | company-semantic | company-clang | company-xcode | company-cmake | company-capf | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev | company-jedi |

[2019-03-14 Thu]
#+begin_src emacs-lisp
  (eval-after-load 'company
    '(progn
       (define-key company-active-map (kbd "<tab>") 'company-complete-common-or-cycle)
       ))

  ;;(company-quickhelp-mode)
(require 'company-box)
(add-hook 'company-mode-hook 'company-box-mode)
#+end_src

#+RESULTS:
| company-box-mode | company-mode-set-explicitly |

** Jedi
#+begin_src emacs-lisp
(add-hook 'python-mode-hook 'jedi:setup)
#+end_src

#+RESULTS:
| jedi:setup | my/python-mode-hook |

** Company jedi
[2019-03-14 Thu]
#+begin_src emacs-lisp
  ;; (defun my/python-mode-hook ()
  ;; )

  ;;   (add-hook 'python-mode-hook 'my/python-mode-hook)
#+end_src

#+RESULTS:
| my/python-mode-hook |

* Nswbuff
[2019-03-14 Thu 04:30]
#+begin_src emacs-lisp
      (use-package nswbuff
        :ensure t
        ;; :config
        ;; (nswbuff-mode +1)
  )
      (define-key global-map (kbd "<C-tab>") 'nswbuff-switch-to-next-buffer)
      (define-key global-map (kbd "<C-S-iso-lefttab>") 'nswbuff-switch-to-previous-buffer)
    (setq nswbuff-buffer-list-function 'nswbuff-projectile-buffer-list)
    (setq nswbuff-display-intermediate-buffers t)
    (setq nswbuff-exclude-buffer-regexps '("^ .*" "^\\*.*\\*"))

#+end_src

#+RESULTS:
| ^ .* | ^\*.*\* |

*** Org-Rss
[2018-12-17 Mon]
This is such a cool idea!!
#+BEGIN_SRC emacs-lisp
(require 'ox-rss)
(add-to-list 'org-publish-project-alist
             '("blog-rss"
		:base-directory "~/public_html/"
		:base-extension "org"
		:publishing-directory "~/public_html/"
		:publishing-function (org-rss-publish-to-rss)
		:html-link-home "http://amoghjalihal.com/"
		:html-link-use-abs-url t
		:exclude ".*"
		:include ("social_1.org")))


(setq org-publish-project-alist
      '(("blog"
         :base-directory "~/public_html/"
         :html-extension "html"
         :base-extension "org"
         :publishing-directory "~/public_html/"
         :publishing-function (org-html-publish-to-html)
         :html-preamble nil
         :html-postamble nil
         :html-head-extra
         "<link rel=\"alternate\" type=\"application/rss+xml\"
                href=\"http://amoghjalihal.org/my-blog.xml\"
                title=\"RSS feed for amoghjalihal.org\">")))

#+END_SRC

#+RESULTS:
| blog | :base-directory | ~/public_html/ | :html-extension | html | :base-extension | org | :publishing-directory | ~/public_html/ | :publishing-function | (org-html-publish-to-html) | :html-preamble | nil | :html-postamble | nil | :html-head-extra | <link rel="alternate" type="application/rss+xml" |

*** Capture Templates
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        '(
          ("t" "Tasks")
          ("tw" "(work) Task/Idea" entry (file+headline "~/jalihal_projects/Research/LabNoteBook.org" "Tasks")
           "** TODO %?  %^g
    :PROPERTIES:
    :CREATED: %U
    :BLOCKER:
    :TRIGGER:
    :END:\n" )

          ("tp" "(personal) Task/Idea" entry (file+headline "~/orgs/PersonalAgenda.org" "Personal Tasks")
           "** TODO %?  %^g
    :PROPERTIES:
    :CREATED: %U
    :BLOCKER:
    :TRIGGER:
    :END:\n" )

          ("c" "Clock tasks")
          ("cw" "work" entry (file+datetree "~/orgs/diary.org")
           "* IN-PROGRESS %? %^g:work:\n%U\n%a\n" :clock-in t :clock-keep t)
          ("cc" "class" entry (file+datetree "~/orgs/diary.org")
           "* IN-PROGRESS %? :class:\n%U\n%a\n" :clock-in t :clock-keep t)
          ("cm" "meeting" entry (file+datetree "~/orgs/diary.org")
           "* IN-PROGRESS Meeting %? :MEETING:\n%U\n" :clock-in t :clock-keep t)
          ("cp" "personal" entry (file+datetree "~/orgs/diary.org")
           "* %?\n%U\n" :clock-in t :clock-keep t)

          ("e" "Entry")
          ("el" "labnotebook" entry (file+datetree "~/jalihal_projects/Research/LabNoteBook.org")
           "* %?
  %U")        

          ("ep" "presentation" entry (file+olp "~/jalihal_projects/Research/LabNoteBook.org" "Presentations")
           "** Meeting -  %U
  ,#+BIND: org-export-use-babel nil
  ,#+STARTUP: beamer
  ,#+OPTIONS: H:1 toc:nil
  ,#+AUTHOR: Amogh Jalihal
  ,#+TITLE: Meeting on %^u
  ,#+EXPORT_FILE_NAME: 
  ,#+LATEX_HEADER: \\usetheme{metropolis}
   #+LATEX_HEADER: \setbeamercolor{background canvas}{bg=white}
  %?" :prepend t :empty-lines 1)
          ("em" "meeting - work" entry (file+olp "~/jalihal_projects/Research/LabNoteBook.org" "Meeting Notes")
           "** Meeting: %? - %U
    :PROPERTIES:
    :CREATED: %U
    :END:
  - " :prepend t :empty-lines 1)        
          ("eM" "meeting - personal" entry (file+olp "~/orgs/meetings-and-discussions.org" "Notes")
           "** With %?
    :PROPERTIES:
    :CREATED: %U
    :END:
     - "  :empty-lines 1)
          ;; Hard coded
          ;; * Classes
          ;; ** Spring 2019
          ;; *** Population Genomics
          ("ec" "Class notes" entry (file+olp "~/orgs/AllNotes.org" "Classes" "Spring 2019" "Population Genomics")
           "** %U
     - %?"  :empty-lines 1)
          ("er" "Reading list " entry (file+olp "~/orgs/AllNotes.org" "Reading List")
           "**  %?
    :PROPERTIES:
    :CREATED: %U
    :CONTEXT: %^{CONTEXT}
    :END:")
          ;;("e" "Event" entry (file+datetree "~/orgs/diary.org")
          ;;"* IN-PROGRESS EVENT with %? :MEETING:\n%t" :clock-in t :clock-resume t)
           ("d" "dump org capture" entry
           (file+headline "~/orgs/dump.org" "Unsorted")
           "* %?%:description Added %U
    ,#+BEGIN_QUOTE
    %x
    ,#+END_QUOTE" :immediate-finish t)

          ("s" "Social" entry (file+olp "~/public_html/social.org" "Social")
           "* \n
    ,#+BEGIN_EXPORT html
    <div class=\"container\">
    ,#+END_EXPORT\n
    %U\n\n%?\n
    ,#+BEGIN_EXPORT html
    </div>
    ,#+END_EXPORT" :prepend t :empty-lines 1)

          ;;("o" "Software and Upkeep" entry (file+datetree "~/orgs/diary.org")
          ;;"* %?:software:\n%t" :clock-in t :clock-resume t)
          ;;("i" "Idea" entry (file org-default-notes-file)
          ;; "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
          ("B" "Behavior" entry (file+datetree "~/orgs/behaviour.org")
           "* %U
           :PROPERTIES:
           :immediate-finish:
           :Water:    %^{Drank?(y/n)|Y|N}
           :Attention: %^{_f_ocussed/_d_istracted|F|D}
           :State:    %^{Feeling _a_ctive/_t_ired?|A|T}
           :END:")
          ;; ("d" "Org-Drill" entry (file+headline "~/orgs/german.org" "Words")
          ;;  "*** %^{Please specify type of word} :drill:\nWhat is the meaning of %^{word}?\n**** Definition\n%^{definition}
          ;;     ")
          ))

  ;;(setq org-capture-templates
  ;;             '("w" "Web site" entry 
  ;;              "* %?\n%c\n%:initial" :clock-in t))

  ;; Allow creation of new parent nodes
  (setq org-refile-allow-creating-parent-nodes `confirm)
  ;; Look up to three levels deep
  (setq org-refile-targets '((org-agenda-files :maxlevel . 4)))
#+END_SRC

#+RESULTS:
: ((org-agenda-files :maxlevel . 4))

** Org-Agenda
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-custom-commands
        ;; The " " here is the shortcut for this agenda, so `C-c a SPC`
        '((" " "Agenda"
           ((agenda "" nil)
           ;;

           ;;
            (tags-todo "paper"
                       ((org-agenda-overriding-header "Paper")))
            (tags-todo "presentation"
                       ((org-agenda-overriding-header "Presentations")))

            (tags-todo "NutSig"
                       ((org-agenda-overriding-header "Model building")))
            (tags-todo "scripting"
                       ((org-agenda-overriding-header "Scripting")))

            (tags-todo "literature"
                       ((org-agenda-overriding-header "Literature")))
            (tags-todo "personal"
                       ((org-agenda-overriding-header "All personal tasks")))

            (tags-todo "work"
                       ((org-agenda-overriding-header "All Research")))
            ;; (tags-todo ""
            ;;            ((org-agenda-overriding-header "Seminar Organization Tasks")))
            ;; (tags-todo "personal"
            ;;            ((org-agenda-overriding-header "Personal Tasks")))
            (todo "TODO"
                  ((org-agenda-overriding-header "Task list")
                   ;; sort by time, priority, and category
                   (org-agenda-sorting-strategy
                    '(time-up priority-down effort-up)))) ;; category-keepx
            ;; Everything on hold
            ;; All "WAITING" items
            (todo "WAITING"
                  ((org-agenda-overriding-header "Future Tasks")))
            )
            )
            ;; ("x" "With deadline columns" agenda* ""
            ;; ((org-agenda-overriding-columns-format "%45ITEM %EFFORT %CLOCKSUM")
            ;; (org-agenda-view-columns-initially t)))
            )
            )
#+END_SRC

#+RESULTS:
|   | Agenda | ((agenda  nil) (tags-todo paper ((org-agenda-overriding-header Paper))) (tags-todo presentation ((org-agenda-overriding-header Presentations))) (tags-todo NutSig ((org-agenda-overriding-header Model building))) (tags-todo scripting ((org-agenda-overriding-header Scripting))) (tags-todo literature ((org-agenda-overriding-header Literature))) (tags-todo personal ((org-agenda-overriding-header All personal tasks))) (tags-todo work ((org-agenda-overriding-header All Research))) (todo TODO ((org-agenda-overriding-header Task list) (org-agenda-sorting-strategy (quote (time-up priority-down effort-up))))) (todo WAITING ((org-agenda-overriding-header Future Tasks)))) |

*** Org agenda column view
[2018-12-02 Sun]
#+BEGIN_SRC elisp
;; format string used when creating CLOCKSUM lines and when generating a
;; time duration (avoid showing days)
(setq org-time-clocksum-format
      '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))
#+END_SRC

#+RESULTS:
| :hours | %d | :require-hours | t | :minutes | :%02d | :require-minutes | t |

  
#+RESULTS:
| ((org-agenda-overriding-columns-format %50ITEM %EFFORT %CLOCKSUM)) |

** Inline Image setting for Org-mode
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Targets include this file and any file contributing to the agenda - up to 5 levels deep
(setq org-image-actual-width nil)
(setq org-toggle-inline-images t)
#+END_SRC
<2018-10-26 Fri>
Refresh inline display
#+BEGIN_SRC elisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
#+END_SRC

#+RESULTS:
| org-display-inline-images |

** Org-alert
[2019-02-07 Thu]
- Shows TODO items for the day every 5 minutes.
#+begin_src emacs-lisp
  (require 'org-alert)
  (setq alert-default-style 'libnotify)
  (setq org-alert-interval 3600)
  (org-alert-enable)
#+end_src

#+RESULTS:
: [nil 23647 12124 168786 3600 org-alert-check nil nil 241000]

** Ox-latex
#+BEGIN_SRC emacs-lisp
(require 'ox-latex)
;;(setq org-latex-listings 'minted)
;;(add-to-list 'org-latex-minted-langs '(ipython "python"))
#+END_SRC
[2019-01-03 Thu]
From John Kitchin's blog
#+begin_src emacs-lisp
  (org-add-link-type
   "comment"
   (lambda (linkstring)
     (let ((elm (org-element-context))
           (use-dialog-box nil))
       (when (y-or-n-p "Delete comment? ")
         (setf (buffer-substring
                (org-element-property :begin elm)
                (org-element-property :end elm))
               (cond
                ((org-element-property :contents-begin elm)
                 (buffer-substring
                  (org-element-property :contents-begin elm)
                  (org-element-property :contents-end elm)))
                (t
                 ""))))))
   (lambda (keyword desc format)
     (cond
      ((eq format 'html)
       (format "<font color=\"red\"><abbr title=\"%s\" color=\"red\">COMMENT</abbr></font> %s" keyword (or desc "")))
      ((eq format 'latex)
      ;; AJ: Ignore the description, format the link part inline
      (format "%% %s\n" keyword)))))
#+end_src

#+RESULTS:
: Created comment link.

** Org-mode Tufte theme
#+BEGIN_SRC elisp
  ;; (use-package org
  ;;   :ensure org-plus-contrib
  ;;   :mode ("\\.org\\'" . org-mode)
  ;;   :bind
  ;;   (("C-c l" . org-store-link)
  ;;    ("C-c a" . org-agenda)
  ;;    ("C-c b" . org-iswitchb)
  ;;    ("C-c c" . org-capture))
  ;;   :bind
  ;;   (:map org-mode-map
  ;;         ("M-n" . outline-next-visible-heading)
  ;;         ("M-p" . outline-previous-visible-heading))
  ;;   :custom
  ;;   (org-return-follows-link t)
  ;;   (org-agenda-diary-file "~/.org/diary.org")
  ;;   (org-babel-load-languages
  ;;    '((emacs-lisp . t)
  ;;      (python . t)))
  ;;   :custom-face
  ;;   (variable-pitch ((t (:family "ETBembo"))))
  ;;   (org-document-title ((t (:foreground "#171717" :weight bold :height 1.5))))
  ;;   (org-done ((t (:background "#E8E8E8" :foreground "#0E0E0E" :strike-through t :weight bold))))
  ;;   (org-headline-done ((t (:foreground "#171717" :strike-through t))))
  ;;   (org-level-1 ((t (:foreground "#090909" :weight bold :height 1.3))))
  ;;   (org-level-2 ((t (:foreground "#090909" :weight normal :height 1.2))))
  ;;   (org-level-3 ((t (:foreground "#090909" :weight normal :height 1.1))))
  ;;   (org-image-actual-width '(600))
  ;;   :config
  ;;   (add-to-list 'org-structure-template-alist '("el" "#+BEGIN_SRC emacs-lisp :tangle yes?\n\n#+END_SRC")))

  ;; (add-hook 'org-mode-hook
  ;;           '(lambda ()
  ;;              (setq line-spacing 0.2) ;; Add more line padding for readability
  ;;              (variable-pitch-mode 1) ;; All fonts with variable pitch.
  ;;              (mapc
  ;;               (lambda (face) ;; Other fonts with fixed-pitch.
  ;;                 (set-face-attribute face nil :inherit 'fixed-pitch))
  ;;               (list 'org-code
  ;;                     'org-link
  ;;                     'org-block
  ;;                     'org-table
  ;;                     'org-verbatim
  ;;                     'org-block-begin-line
  ;;                     'org-block-end-line
  ;;                     'org-meta-line
  ;;                     'org-document-info-keyword))))

  ;;  (org-document-title
  ;;    (:inherit variable-pitch
  ;;              :height 1.3
  ;;              :weight normal
  ;;              :foreground ,gray)
  ;;    (:inherit nil
  ;;              :family ,et-font
  ;;              :height 1.8
  ;;              :foreground ,bg-dark
  ;;              :underline nil))
  ;;   (org-document-info
  ;;    (:foreground ,gray
  ;;                 :slant italic)
  ;;    (:height 1.2
  ;;             :slant italic))
  ;;   (org-level-1
  ;;    (:inherit variable-pitch
  ;;              :height 1.3
  ;;              :weight bold
  ;;              :foreground ,keyword
  ;;              :background ,bg-dark)
  ;;    (:inherit nil
  ;;              :family ,et-font
  ;;              :height 1.6
  ;;              :weight normal
  ;;              :slant normal
  ;;              :foreground ,bg-dark))
  ;;   (org-level-2
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.2
  ;;              :foreground ,gray
  ;;              :background ,bg-dark)
  ;;    (:inherit nil
  ;;              :family ,et-font
  ;;              :weight normal
  ;;              :height 1.3
  ;;              :slant italic
  ;;              :foreground ,bg-dark))
  ;;   (org-level-3
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    (:inherit nil
  ;;              :family ,et-font
  ;;              :weight normal
  ;;              :slant italic
  ;;              :height 1.2
  ;;              :foreground ,bg-dark))
  ;;   (org-level-4
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    (:inherit nil
  ;;              :family ,et-font
  ;;              :weight normal
  ;;              :slant italic
  ;;              :height 1.1
  ;;              :foreground ,bg-dark))
  ;;   (org-level-5
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    nil)
  ;;   (org-level-6
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    nil)
  ;;   (org-level-7
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    nil)
  ;;   (org-level-8
  ;;    (:inherit variable-pitch
  ;;              :weight bold
  ;;              :height 1.1
  ;;              :foreground ,slate
  ;;              :background ,bg-dark)
  ;;    nil)
  ;;   (org-headline-done
  ;;    (:strike-through t)
  ;;    (:family ,et-font
  ;;             :strike-through t))
  ;;   (org-quote
  ;;    (:background ,bg-dark)
  ;;    nil)
  ;;   (org-block
  ;;    (:background ,bg-dark)
  ;;    (:background nil
  ;;                 :foreground ,bg-dark))
  ;;   (org-block-begin-line
  ;;    (:background ,bg-dark)
  ;;    (:background nil
  ;;                 :height 0.8
  ;;                 :family ,sans-mono-font
  ;;                 :foreground ,slate))
  ;;   (org-block-end-line
  ;;    (:background ,bg-dark)
  ;;    (:background nil
  ;;                 :height 0.8
  ;;                 :family ,sans-mono-font
  ;;                 :foreground ,slate))
  ;;   (org-document-info-keyword
  ;;    (:foreground ,comment)
  ;;    (:height 0.8
  ;;             :foreground ,gray))
  ;;   (org-link
  ;;    (:underline nil
  ;;                :weight normal
  ;;                :foreground ,slate)
  ;;    (:foreground ,bg-dark))
  ;;   (org-special-keyword
  ;;    (:height 0.9
  ;;             :foreground ,comment)
  ;;    (:family ,sans-mono-font
  ;;             :height 0.8))
  ;;   (org-todo
  ;;    (:foreground ,builtin
  ;;                 :background ,bg-dark)
  ;;    nil)
  ;;   (org-done
  ;;    (:inherit variable-pitch
  ;;              :foreground ,dark-cyan
  ;;              :background ,bg-dark)
  ;;    nil)
  ;;   (org-agenda-current-time
  ;;    (:foreground ,slate)
  ;;    nil)
  ;;   (org-hide
  ;;    nil
  ;;    (:foreground ,bg-white))
  ;;   (org-indent
  ;;    (:inherit org-hide)
  ;;    (:inherit (org-hide fixed-pitch)))
  ;;   (org-time-grid
  ;;    (:foreground ,comment)
  ;;    nil)
  ;;   (org-warning
  ;;    (:foreground ,builtin)
  ;;    nil)
  ;;   (org-date
  ;;    nil
  ;;    (:family ,sans-mono-font
  ;;             :height 0.8))
  ;;   (org-agenda-structure
  ;;    (:height 1.3
  ;;             :foreground ,doc
  ;;             :weight normal
  ;;             :inherit variable-pitch)
  ;;    nil)
  ;;   (org-agenda-date
  ;;    (:foreground ,doc
  ;;                 :inherit variable-pitch)
  ;;    (:inherit variable-pitch
  ;;              :height 1.1))
  ;;   (org-agenda-date-today
  ;;    (:height 1.5
  ;;             :foreground ,keyword
  ;;             :inherit variable-pitch)
  ;;    nil)
  ;;   (org-agenda-date-weekend
  ;;    (:inherit org-agenda-date)
  ;;    nil)
  ;;   (org-scheduled
  ;;    (:foreground ,gray)
  ;;    nil)
  ;;   (org-upcoming-deadline
  ;;    (:foreground ,keyword)
  ;;    nil)
  ;;   (org-scheduled-today
  ;;    (:foreground ,fg-white)
  ;;    nil)
  ;;   (org-scheduled-previously
  ;;    (:foreground ,slate)
  ;;    nil)
  ;;   (org-agenda-done
  ;;    (:inherit nil
  ;;              :strike-through t
  ;;              :foreground ,doc)
  ;;    (:strike-through t
  ;;                     :foreground ,doc))
  ;;   (org-ellipsis
  ;;    (:underline nil
  ;;                :foreground ,comment)
  ;;    (:underline nil
  ;;                :foreground ,comment))
  ;;   (org-tag
  ;;    (:foreground ,doc)
  ;;    (:foreground ,doc))
  ;;   (org-table
  ;;    (:background nil)
  ;;    (:family ,serif-mono-font
  ;;             :height 0.9
  ;;             :background ,bg-white))
  ;;   (org-code
  ;;    (:inherit font-lock-builtin-face)
  ;;    (:inherit nil
  ;;              :family ,serif-mono-font
  ;;              :foreground ,comment
  ;; :height 0.9))
#+END_SRC

#+RESULTS:
| (lambda nil (setq line-spacing 0.2) (variable-pitch-mode 1) (mapc (lambda (face) (set-face-attribute face nil :inherit (quote fixed-pitch))) (list (quote org-code) (quote org-link) (quote org-block) (quote org-table) (quote org-verbatim) (quote org-block-begin-line) (quote org-block-end-line) (quote org-meta-line) (quote org-document-info-keyword)))) | org-ref-org-menu | (lambda nil (delete (quote (\.pdf\' . default)) org-file-apps) (add-to-list (quote org-file-apps) (quote (\.pdf\' . evince %s)))) | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

** Better Ediff for org-mode
<2018-10-26 Fri>
From [[https://emacs.stackexchange.com/questions/21335/prevent-folding-org-files-opened-by-ediff][here]]
#+BEGIN_SRC elisp
;; Check for org mode and existence of buffer
(defun f-ediff-org-showhide (buf command &rest cmdargs)
  "If buffer exists and is orgmode then execute command"
  (when buf
    (when (eq (buffer-local-value 'major-mode (get-buffer buf)) 'org-mode)
      (save-excursion (set-buffer buf) (apply command cmdargs)))))

(defun f-ediff-org-unfold-tree-element ()
  "Unfold tree at diff location"
  (f-ediff-org-showhide ediff-buffer-A 'org-reveal)  
  (f-ediff-org-showhide ediff-buffer-B 'org-reveal)  
  (f-ediff-org-showhide ediff-buffer-C 'org-reveal))

(defun f-ediff-org-fold-tree ()
  "Fold tree back to top level"
  (f-ediff-org-showhide ediff-buffer-A 'hide-sublevels 1)  
  (f-ediff-org-showhide ediff-buffer-B 'hide-sublevels 1)  
  (f-ediff-org-showhide ediff-buffer-C 'hide-sublevels 1))

(add-hook 'ediff-select-hook 'f-ediff-org-unfold-tree-element)
(add-hook 'ediff-unselect-hook 'f-ediff-org-fold-tree)
#+END_SRC

#+RESULTS:
| f-ediff-org-fold-tree |
** Org download
<2018-11-28 Wed>
#+begin_src elisp
    (setq-default org-download-image-dir "~/orgs/downloads/")
(add-hook 'dired-mode-hook 'org-download-enable)
#+end_src  

#+RESULTS:
| org-download-enable | (lambda nil (dired-hide-details-mode)) |
** Customizing org-todo keywords
#+BEGIN_SRC elisp
  (setq org-todo-keyword-faces
        '(("TODO" . org-warning) ("FAILED" . "yellow")
          ("CANCELED" . "yellow")
          ("IN-PROGRESS" . (:foreground "blue"))))
#+END_SRC

#+RESULTS:
: ((TODO . org-warning) (FAILED . yellow) (CANCELED . yellow) (IN-PROGRESS :foreground blue))
** Org noter
[2019-01-14 Mon]
#+begin_src emacs-lisp
  (setq ;;org-noter-property-doc-file "~/orgs/org-noter-notes/"
        ;;org-noter-property-note-location "~/orgs/org-noter-notes/"
        org-noter-default-notes-file-names '("Notes.org")
        org-noter-notes-search-path '("~/orgs/org-noter-notes/")
)
#+end_src

#+RESULTS:
| ~/orgs/org-noter-notes/ |

** Auctex latex export style
[2019-01-28 Mon]
#+begin_src emacs-lisp
(setq LaTeX-command-style '(("" "%(PDF)%(latex) %(file-line-error) %(extraopts) -shell-escape %S%(PDFout)")))
#+end_src

#+RESULTS:
|   | %(PDF)%(latex) %(file-line-error) %(extraopts) -shell-escape %S%(PDFout) |
** Synctex
[2019-01-28 Mon]
#+begin_src emacs-lisp

   (setq TeX-source-correlate-method (quote synctex))
   (setq TeX-source-correlate-mode t)
   (setq TeX-source-correlate-start-server t)
   (setq TeX-view-program-selection '((output-pdf "PDF Tools")))
   (add-hook 'TeX-after-compilation-finished-functions
   #'TeX-revert-document-buffer)

   ;;(setq TeX-view-program-list (quote (("Okular" "okular --unique %o#src:%n%b"))))
   ;;(setq TeX-view-program-selection (quote ((engine-omega "dvips and gv") (output-dvi "xdvi") (output-pdf "Okular") (output-html "xdg-open")))))
#+end_src

#+RESULTS:
| Okular | okular --unique %o#src:%n%b |

** Auctex synctex configuration
#+begin_src emacs-lisp
  ;; Use pdf-tools to open PDF files
;;(server-start)
  (setq TeX-view-program-selection '((output-pdf "PDF Tools")))

     (setq TeX-source-correlate-method 'synctex)

     (setq TeX-source-correlate-mode t)

     (setq TeX-source-correlate-start-server t)


  (add-hook 'TeX-after-compilation-finished-functions
             #'TeX-revert-document-buffer)
     ;;'(TeX-view-program-list (quote (("Okular" "okular --unique %o#src:%n%b"))))
     ;;'(TeX-view-program-selection (quote ((engine-omega "dvips and gv") (output-dvi "xdvi") (output-pdf "Okular") (output-html "xdg-open")))))
#+end_src

#+RESULTS:
| TeX-revert-document-buffer |

* PDF-tools
+Deleted package on <2018-01-02 Tue>+
Reinstalling on cerevisaj on <2018-01-02 Tue>
#+BEGIN_SRC emacs-lisp
  ;; installation for pdf-tools
  ;;(pdf-tools-install)
  (setq-default pdf-view-midnight-colors '("#d4d4d6" . "#000000")) ;;'( "#00E3FF" . "#372963" );;
(use-package pdf-tools
  :ensure t
  :mode ("\\.pdf\\'" . pdf-tools-install)
  :bind ("C-c C-g" . pdf-sync-forward-search)
  :defer t
  :config
  (setq mouse-wheel-follow-mouse t)
  (setq pdf-view-resize-factor 1.10)

)  ;; "#313133")) 
#+END_SRC

#+RESULTS:
: pdf-sync-forward-search
[2019-02-20 Wed]
Customizing midnight mode colors
#+begin_src emacs-lisp

#+end_src

#+RESULTS:
: (#d4d4d6 . #000000)

